TAL_INT_GIT/Sample Data/Nupco/Reservation_Create/input/res_create_soap_input/res_create_soap_input

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">

   <soapenv:Header/>

   <soapenv:Body>

      <urn:ZMM_RESERVATION_HOS_INTERFACE>

         <I_INPUT>

            <RES_DATE>2021-02-08</RES_DATE>

            <MOVE_TYPE>501</MOVE_TYPE>

            <LIFNR>110001</LIFNR>

            <CUSTPO>4500015781</CUSTPO>

            <KUNNR>120000</KUNNR>

            <HOS_REF>hos123</HOS_REF>

            <ITEM>

               <!--Zero or more repetitions:-->

               <item>

                  <MATERIAL>4110631309301</MATERIAL>

                  <PLANT>C2C1</PLANT>

                  <STGE_LOC>1000</STGE_LOC>

                  <ENTRY_QNT>100</ENTRY_QNT>

                  <ENTRY_UOM>EA</ENTRY_UOM>

                  <REQ_DATE>2021-02-10</REQ_DATE>

                  <GL_ACCOUNT>115306</GL_ACCOUNT>

                  <ITEM_TEXT>1123457741</ITEM_TEXT>

                  <UNLOAD_PT>50</UNLOAD_PT>

               </item>

            </ITEM>

         </I_INPUT>

      </urn:ZMM_RESERVATION_HOS_INTERFACE>

   </soapenv:Body>

</soapenv:Envelope>